{
  "title": "Software Engineer",
  "viewSite": "View site",
  "taskBoard": "Task board",
  "pageNotFound": "Page not found",
  "menu": {
    "work": "Projects",
    "skills": "Skills",
    "experience": "Experience",
    "aboutMe": "About me"
  },
  "hints": {
    "home": "Home",
    "languageSwitch": "Language switch",
    "themeSwitch": "Theme switch"
  },
  "mock": {
    "skills": {
      "description": "Here you can see some technologies that I have affinity. The list will be updated as I evolve and remember others' skills."
    },
    "experience": {
      "octadesk": "Built a chat widget that connects with other company projects, helping other squads by fixing their bugs, developing a mobile and desktop chat application.",
      "ambevTech": "I started to develop a platform to connect, manage and track several DevOps features from Azure and others.",
      "seniorSistemas": "I worked on a business management system as a frontend developer, creating new features and fixing bugs. Also, I have created a new app for managers, that integrates with Senior's solutions."
    },
    "aboutMe": {
      "resume": "I had always wanted to work with technology. When I was a child, I remember that my first contact with this universe was on a Tibia server that I created to play with my friends and it ended up working out vey well. In those days, I didn't think that this area was really for me. Many years later, the fate led me to meet a JAVA course, where I completed a small application with JAVA, MySQL, JS, HTML, and CSS as my final project, which sparked my interest in programming.\n\n Since then, I have specialized in frontend development, primarily using JS frameworks such as Angular, React, Vue, and Svelte. I also did some works with Ionic and Flutter.\n\n I love getting to know new technologies, testing concepts and seeing the things working. I have been gaining experience in DevOps, Backend and UI/UX areas. I intend to do more projects related to these areas, to reinforce my knowledge and learn new things."
    },
    "projects": {
      "aboutMe": {
        "title": "This project (About me)",
        "description": "This project was create with objective of telling a bit about myself, my habilities, experiences, curiosities and also to present some project that I will be developing. I believe that this project can evolve into more topics in the future."
      },
      "weatherNow": {
        "title": "Weather now",
        "description": "I created this project to participate in a short timeline challenge, where it was necessery to create a page to present weather information about some specific cities. I took this opportunity to learn more about Vue3 and see the differences between it and Vue2."
      }
    }
  }
}
