{
  "title": "Software Engineer",
  "viewSite": "View site",
  "taskBoard": "Task board",
  "pageNotFound": "Page not found",
  "menu": {
    "work": "Projects",
    "skills": "Skills",
    "experience": "Experience",
    "aboutMe": "About me"
  },
  "hints": {
    "home": "Home",
    "languageSwitch": "Language switch",
    "themeSwitch": "Theme switch"
  },
  "mock": {
    "skills": {
      "description": "Here you can see some technologies that I have affinity. The list will be updated as I evolve and remember others' skills."
    },
    "experience": {
      "octadesk": "Built a chat widget that connects with other company projects, helping other squads by fixing their bugs, developing a mobile and desktop chat application.",
      "ambevTech": "I started to develop a platform to connect, manage and track several DevOps features from Azure and others.",
      "seniorSistemas": "I worked on a business management system as a frontend developer, creating new features and fixing bugs. Also, I have created a new app for managers, that integrates with Senior's solutions."
    },
    "aboutMe": {
      "resume": "I had always wanted to work with technology. When I was a child, I remember that my first contact with this universe was on a Tibia server that I created to play with my friends and it ended up working out vey well. In those days, I didn't think that this area was really for me. Many years later, the fate led me to meet a JAVA course, where I completed a small application with JAVA, MySQL, JS, HTML, and CSS as my final project, which sparked my interest in programming.\n\n Since then, I have specialized in frontend development, primarily using JS frameworks such as Angular, React, Vue, and Svelte. I also did some works with Ionic and Flutter.\n\n I love getting to know new technologies, testing concepts and seeing the things working. I have been gaining experience in DevOps, Backend and UI/UX areas. I intend to do more projects related to these areas, to reinforce my knowledge and learn new things."
    },
    "projects": {
      "aboutMe": {
        "title": "This project (About me)",
        "description": "This project was create with objective of telling a bit about myself, my habilities, experiences, curiosities and also to present some project that I will be developing.\n\n I believe that this project can evolve into more topics in the future."
      },
      "vueWeatherChallenge": {
        "title": "Vue Weather Challenge",
        "description": "This project aimed to meet a challenge, where a page was created to present weather information for specific cities. \n\n The layout and design of the project align with the challenge's proposal."
      },
      "nextjsCoinChallenge": {
        "title": "Nextjs Coin Challenge",
        "description": "This project was developed to meet a challenge.\n\n It's a Cryptos project with real data on a specific date. In the future, it can be improved to have real-time data. I'm using SSR in it, although SSG and even SPA could be used in some cases, since the data is static through the API available at /api/coins, I'm only using SSR.\n\n The layout and design of the project align with the challenge's proposal."
      },
      "vueGiphyChallenge": {
        "title": "Vue Giphy Challenge",
        "description": "This project was developed to meet a short-term challenge of approximately 1 day.\n\n Here, I developed a system that fetches GIFs from an external API. It is possible to search for specific GIFs and by categories. Also, you can click on a GIF to view it in a larger resolution and be able to copy its sharing link.\n\n Something cool that I implemented is that you can load countless GIFs without losing performance in the browser."
      },
      "angularCalendarChallenge": {
        "title": "Angular Calendar Challenge",
        "description": "This project was developed to meet a short-term challenge and was completed in approximately 3 days.\n\n Here, we have a simulation of a calendar with appointment scheduling and drag and drop functionality to change the date and time of appointments. You can create a new event on the schedule by clicking on 'Create' or by clicking on a specific time on the calendar days.\n\n This project uses Nx, which is a build system, and the application was built using the Component First Architecture. Some project configurations are located in src/app, but the core of the application is in libs/calendar/src/lib/."
      },
      "angularPlatformChallenge": {
        "title": "Angular Platform Challenge",
        "description": "This project was developed to meet a short-term challenge of approximately 1 day.\n\n Several components were created in the project using Bootstrap and can be found in the folder src/app/components.\n\n The layout and design of the project align with the challenge's proposal."
      }
    }
  }
}