{
  "title": "Software Engineer",
  "menu": {
    "work": "Work",
    "skills": "Skills",
    "experience": "Experience",
    "aboutMe": "About me"
  },
  "hints": {
    "home": "Home",
    "languageSwitch": "Language switch",
    "themeSwitch": "Theme switch"
  },
  "mock": {
    "skills": {
      "description": "Here you can see some technologies that I've more affinity. As I evolve and remeber others, I'll adding them to this list."
    },
    "experience": {
      "octadesk": "Building a chat widget that connects with other company projects. Helping other squads by fixing their bugs. Working on a mobile/desktop app chat application.",
      "ambevTech": "I started to develop a platform to connect, manage and tracking several DevOps features from Azure and others",
      "seniorSistemas": "I worked on maintaining our squad projects and working on some new features. I also helped other squads with their frontend deliveries. Also, I created a new app for managers and plugging our solutions into it."
    },
    "aboutMe": {
      "resume": "Sempre tive vontade de trabalhar com tecnologia. Lembro que quando criança, meu primeiro contato nesse universo foi em um servidor de Tibia que criei para jogar com alguns amigos e acabou dando muito certo. Porém nunca achei que essa área era de fato pra mim. Foi então que vários anos depois o destino me levou de encontro a um curso de JAVA, onde desenvolvi no meu TCC uma pequena aplicação com JAVA, Mysql, JS, Html e CSS que despertou de fato meu interesse por programação.\n\n Desde então, venho me especializando no frontend, atuando com os principais frameworks JS do mercado, como: Angular, React, Vue e Svelte. Também fiz alguns trabalhos no desenvolvimento mobile, com Ionic e Flutter.\n\n Adoro conhecer novas tecnologias, testar conceitos e ver as coisas funcionando. Venho ampliando meus conhecimentos nas áreas de DevOps, Backend e UI/UX. Pretendo fazer mais projetos relacionados a essas áreas, para reforçar conhecimentos e aprender coisas novas. "
    },
    "projects": {
      "aboutMe": {
        "title": "This project (About me)",
        "description": "asd"
      },
      "weatherNow": {
        "title": "Weather now",
        "description": "dsa"
      }
    }
  }
}
