{
  "title": "Engenheiro de Software",
  "viewSite": "Ver site",
  "taskBoard": "Quadro de tarefas",
  "pageNotFound": "Página não encontrada",
  "menu": {
    "work": "Projetos",
    "skills": "Habilidades",
    "experience": "Experiência",
    "aboutMe": "Sobre mim"
  },
  "hints": {
    "home": "Pagina principal",
    "languageSwitch": "Troca de idioma",
    "themeSwitch": "Troca de tema"
  },
  "mock": {
    "skills": {
      "description": "Aqui você pode ver algumas das tecnologias que tenho mais afinidade. Conforme for evoluindo e lembrando de outras, estarei adicionando elas aqui nessa listagem."
    },
    "experience": {
      "octadesk": "- Desenvolvi um widget com funcionalidades de chat conversacional similar ao WhatsApp, incluindo a renderização de imagens, resposta de mensagens, citações e anexos, além de criar componentes para se conectar com bots.\n\n - Também trabalhei em outros módulos do sistema, como o Ticket e o Chat, apoiando na correção de problemas e desenvolvimento de novas funcionalidades.\n\n - Atuei na manutenção de um aplicativo em Flutter e tive a oportunidade de resolver mais de 20 problemas críticos de clientes, solucionando todos os bugs reportados na época.\n\n - Além disso, desenvolvi o CI/CD desse aplicativo para Android, contando com o apoio de um colega que possuía um Mac para trabalhar na versão IOS.\n\n - Trabalhei em novas funcionalidades para esse aplicativo, incluindo a implementação de push notifications.",
      "ambevTech": "- Desenvolvi do zero o front-end de uma plataforma inovadora, utilizando ReactJS, AntDesign e testes com Jest. A plataforma é construída dinamicamente com base em parâmetros recebidos da API, tornando-a altamente escalável e adaptável.\n\n - A plataforma oferece uma gestão eficiente e integrada de todo o processo de desenvolvimento de software, desde o planejamento até a entrega, conectando os usuários a serviços disponíveis no Azure DevOps e a outros serviços DevOps personalizados.\n\n - Também criei as definições visuais das interfaces do sistema no Figma.",
      "seniorSistemas": "- Atuei no desenvolvimento e evolução de módulos como Comercial, Manufatura, Finanças e Agronegócio.\n\n - Desenvolvi um aplicativo em Ionic que apresentava um dashboard do sistema, fornecendo insights valiosos para os usuários e outras funcionalidades adicionais.\n\n - Durante a sustentação desses sistemas, dediquei-me a resolver bugs e refatorar o código para melhorar a performance e a escalabilidade.\n\n - Fui responsável por ajudar no desenvolvimento do produto ERP XT, com foco na integração entre um sistema desktop e um sistema web, e participei de várias etapas do processo.\n\n - Desenvolvi um aplicativo em Flutter para gestores de empresas, permitindo que eles controlassem toda a burocracia das requisições de materiais internos diretamente de seus celulares.\n\n - Atuei no desenvolvimento de um novo produto para o módulo de Agronegócio."
    },
    "aboutMe": {
      "resume": "Sempre tive vontade de trabalhar com tecnologia. Lembro que quando criança, meu primeiro contato nesse universo foi em um servidor de Tibia que criei para jogar com alguns amigos e acabou dando muito certo. Naqueles tempos não achava que essa área era de fato pra mim. Foi então que vários anos depois o destino me levou de encontro a um curso de JAVA, onde desenvolvi no meu TCC uma pequena aplicação com JAVA, Mysql, JS, Html e CSS que despertou de fato meu interesse por programação.\n\n Desde então, venho me especializando no frontend, atuando com os principais frameworks JS do mercado, como: Angular, React, Vue e Svelte. Também fiz alguns trabalhos no desenvolvimento mobile, com Ionic e Flutter.\n\n Adoro conhecer novas tecnologias, testar conceitos e ver as coisas funcionando. Venho ampliando meus conhecimentos nas áreas de DevOps, Backend e UI/UX. Pretendo fazer mais projetos relacionados a essas áreas, para reforçar conhecimentos e aprender coisas novas."
    },
    "projects": {
      "aboutMe": {
        "title": "Este projeto (About me)",
        "description": "Este projeto foi criado com o objetivo de contar um pouco sobre mim, minhas habilidades, experiências, curiosidades e também, apresentar alguns projetos que estarei desenvolvendo.\n\n Acredito que esse projeto possa evoluir em mais tópicos futuramente."
      },
      "vueWeatherChallenge": {
        "title": "Vue Weather Challenge",
        "description": "Este projeto teve como objetivo atender a um desafio, onde foi criado uma página para apresentar informações climáticas de algumas específicas cidades. \n\n O layout e design do projeto estao de acordo com a proposta do desafio."
      },
      "nextjsCoinChallenge": {
        "title": "Nextjs Coin Challenge",
        "description": "Este projeto foi desenvolvido para atender a um desafio.\n\n É um projeto de Criptomoedas com dados reais em uma data específica. No futuro, ele pode ser aprimorado para ter dados em tempo real. Estou utilizando SSR (Renderização do Lado do Servidor) nele, embora SSG (Geração Estática do Lado do Servidor) e até mesmo SPA (Aplicação de Página Única) possam ser usados em alguns casos. Como os dados são estáticos por meio da API disponível em /api/coins, estou usando apenas SSR.\n\n O layout e design do projeto estao de acordo com a proposta do desafio."
      },
      "vueGiphyChallenge": {
        "title": "Vue Giphy Challenge",
        "description": "Este projeto foi desenvolvido para atender a um desafio de curto prazo de aproximadamente 1 dia.\n\n Aqui, desenvolvi um sistema que busca GIFs de uma API externa. É possível pesquisar GIFs específicos e por categorias. Além disso, você pode clicar em um GIF para visualizá-lo em uma resolução maior e ser capaz de copiar seu link de compartilhamento.\n\n Algo legal que implementei é que você pode carregar inúmeros GIFs sem perder desempenho no navegador."
      },
      "angularCalendarChallenge": {
        "title": "Angular Calendar Challenge",
        "description": "Este projeto foi desenvolvido para atender a um desafio de curto prazo e foi desenvolvido em aproximadamente 3 dias.\n\n Aqui temos uma simulacao de um calendario com cadastro de agendamentos e drag and drop para alterar a data e hora dos agendamentos. Voce pode criar um novo evento na agenda clicando em Create ou clicando em alguma hora nos dias do calendario.\n\n Esse projeto usa Nx que eh um build system e a aplicacao foi construida usando Component First Architecture. Algumas configuracoes do projeto ficam em src/app porem o principal da aplicacao esta em libs/calendar/src/lib/."
      },
      "angularPlatformChallenge": {
        "title": "Angular Platform Challenge",
        "description": "Este projeto foi desenvolvido para atender a um desafio de curto prazo de aproximadamente 1 dia.\n\n Foram criados diversos componentes no projeto usando o bootstrap e se encontram na pasta src/app/components.\n\n O layout e design do projeto estao de acordo com a proposta do desafio."
      }
    }
  }
}