{
  "title": "Engenheiro de Software",
  "menu": {
    "work": "Projetos",
    "skills": "Habilidades",
    "experience": "Experiência",
    "aboutMe": "Sobre mim"
  },
  "hints": {
    "home": "Pagina principal",
    "languageSwitch": "Troca de idioma",
    "themeSwitch": "Troca de tema"
  },
  "mock": {
    "skills": {
      "description": "Aqui você pode ver algumas das tecnologias que tenho mais afinidade. Conforme for evoluindo e lembrando de outras, estarei adicionando elas aqui nessa listagem."
    },
    "experience": {
      "octadesk": "Estou construindo um widget chat que se conecta com outros projetos da empresa, auxilio outras squads na correção de bugs e estou trabalhando em um aplicativo de conversas em versão mobile/desktop.",
      "ambevTech": "Iniciei o desenvolvimento de uma plataforma para conectar, gerenciar e acompanhar varios serviços DevOps da Azure e outros ambientes.",
      "seniorSistemas": "Trabalhei na sustentação de projetos, cuidando tanto da correção de bugs quanto implementação de novas entregas em diversos times. Atuei no desenvolvimento de um APP para os gestores para auxiliar o gerenciamento de suas equipes."
    },
    "aboutMe": {
      "resume": "Sempre tive vontade de trabalhar com tecnologia. Lembro que quando criança, meu primeiro contato nesse universo foi em um servidor de Tibia que criei para jogar com alguns amigos e acabou dando muito certo. Porém nunca achei que essa área era de fato pra mim. Foi então que vários anos depois o destino me levou de encontro a um curso de JAVA, onde desenvolvi no meu TCC uma pequena aplicação com JAVA, Mysql, JS, Html e CSS que despertou de fato meu interesse por programação.\n\n Desde então, venho me especializando no frontend, atuando com os principais frameworks JS do mercado, como: Angular, React, Vue e Svelte. Também fiz alguns trabalhos no desenvolvimento mobile, com Ionic e Flutter.\n\n Adoro conhecer novas tecnologias, testar conceitos e ver as coisas funcionando. Venho ampliando meus conhecimentos nas áreas de DevOps, Backend e UI/UX. Pretendo fazer mais projetos relacionados a essas áreas, para reforçar conhecimentos e aprender coisas novas."
    },
    "projects": {
      "aboutMe": {
        "title": "This project (About me)",
        "description": "asd"
      },
      "weatherNow": {
        "title": "Weather now",
        "description": "dsa"
      }
    }
  }
}
